update layer diagram
