--- a/docs/architecture/basics.md
+++ b/docs/architecture/basics.md
@@ -7,15 +7,25 @@ title: Basics
+and has its own update cycle.
 
 
-```mermaid
-graph TD;
-    A(Presentation Layer: Gipfeli Frontend)-->B(Business Layer: Gipfeli Api);
-    B-->C(Data Layer: PostgreSQL);
-    C-->D(PostgreSQL Server);
+```plantuml
+@startuml
+skinparam componentStyle rectangle
+skinparam minClassWidth 300
+skinparam DefaultTextAlignment center
+component "Presentation Layer: Gipfeli Frontend" as A
+component "Business Layer: Gipfeli Api" as B
+component "Data Layer: PostgreSQL" as C
+component "PostgreSQL Server" as D
+
+A -d-> B
+B -d-> C
+C -d-> D
+
+@enduml
 ```
 
